const translations = {
    "en": {
        "Фото:": "Photos:",
        "Комбо:": "Combo:",
        "Фото: 0": "Photos: 0",
        "Комбо: 0": "Combo: 0",
        "Старт": "Start",
        "Сделано": "Made by",
        "FAQ (Часто задаваемые вопросы)": "FAQ (Frequently Asked Questions)",
        "- Что это такое?": "- What is this?",
        "Утилита, имитирующая мерцания призраков в игре Фазмафобия и дающая возможность научиться фотографировать призрака.": "A utility that simulates ghost flickering in the game Phasmophobia and allows you to practice ghost photography.",
        "- Как использовать?": "- How to use?",
        "В настройках выбрать модель и тип мерцаний, после чего нажать кнопку старт.": "In the settings, select the model and flicker type, then press the start button.",
        "- Почему не регает клики?": "- Why are clicks not registered?",
        "Засчитывает только когда видно призрака. Убедитесь, что вы не нажимаете на клавишу рестарт.": "Only counts when the ghost is visible. Make sure you are not clicking the restart button.",
        "- Можно ли добавить своё изображение?": "- Can I add my own image?",
        "Да, выбрать custom и вставить ссылку из интернета (можно загрузить, например, в Дискорд и скопировать ссылку).": "Yes, select custom and paste a link from the internet (you can upload to Discord and copy the link).",
        "Отдельное спасибо:": "Special thanks:",
        "Сохранять выбранные настройки": "Save selected settings",
        "Показывать таймлайн:": "Show timeline:",
        "Показывать стрелочку:": "Show arrow:",
        "Добавить 1 секунду:": "Add 1 second:",
        "Смена облика Обакэ:": "Obake shape shift:",
        "Выбрать фотоаппарат": "Select camera",
        "Выбрать тип мерцания": "Select blinking type",
        "Выбрать модель призрака": "Select ghost model",
        "Тип мерцаний:": "Blinking type:",
        "Применить": "Apply",
        "Вставьте ссылку": "Paste URL",
        "Обычный": "Default",
        "Фантом": "Phantom",
        "Они": "Oni",
        "Деоген": "Deogen",
        "1 сбитый": "1 shifted",
        "2 сбитый": "2 shifted",
        "Включить воспроизведение звука фотографии": "Enable photo sound",
        "Включить задержку выбранного фотоаппарата": "Enable selected camera delay",
        "Длиннейшее пропадание": "Longest invisible",
        "soshyrey": "soshyrey",
        "dont lucky": "dont lucky",
        "Длиннейшее появление": "Longest visible",
        "22 секунда охоты": "22 second of hunting",
        "1ый обакэ (12 мерцание)": "1st obake (12 blink)",
        "Они временно не доступен из-за технических ограничений": "Oni temporarily unavailable due to technical limitations.",
        "Видно": "Visible",
        "Не видно": "Invisible",
        "мс": "ms",
        "Отображение периода мерцаний призрака": "Displaying the ghost's flicker period",
        "Индикатор текущего мерцания призрака": "The current ghost flicker indicator",
        "Правильное отображения мерцаний в начале охоты": "Correct display of flickers at the beginning of the hunt",
        "Включить появление Обакэ": "Turn on the appearance of the Obake",
        "Сменить язык": "Change language",
        "Задержка при зажатии (до 400 мс)": "Delay when holding (up to 400 ms)",
    },
    "ru": {
        "Фото:": "Фото:",
        "Комбо:": "Комбо:",
        "Фото: 0": "Фото: 0",
        "Комбо: 0": "Комбо: 0",
        "Старт": "Старт",
        "Сделано": "Сделано",
        "FAQ (Часто задаваемые вопросы)": "FAQ (Часто задаваемые вопросы)",
        "- Что это такое?": "- Что это такое?",
        "Утилита, имитирующая мерцания призраков в игре Фазмафобия и дающая возможность научиться фотографировать призрака.": "Утилита, имитирующая мерцания призраков в игре Фазмафобия и дающая возможность научиться фотографировать призрака.",
        "- Как использовать?": "- Как использовать?",
        "В настройках выбрать модель и тип мерцаний, после чего нажать кнопку старт.": "В настройках выбрать модель и тип мерцаний, после чего нажать кнопку старт.",
        "- Почему не регает клики?": "- Почему не регает клики?",
        "Засчитывает только когда видно призрака. Убедитесь, что вы не нажимаете на клавишу рестарт.": "Засчитывает только когда видно призрака. Убедитесь, что вы не нажимаете на клавишу рестарт.",
        "- Можно ли добавить своё изображение?": "- Можно ли добавить своё изображение?",
        "Да, выбрать custom и вставить ссылку из интернета (можно загрузить, например, в Дискорд и скопировать ссылку).": "Да, выбрать custom и вставить ссылку из интернета (можно загрузить, например, в Дискорд и скопировать ссылку).",
        "Отдельное спасибо:": "Отдельное спасибо:",
        "Сохранять выбранные настройки": "Сохранять выбранные настройки",
        "Показывать таймлайн:": "Показывать таймлайн:",
        "Показывать стрелочку:": "Показывать стрелочку:",
        "Добавить 1 секунду:": "Добавить 1 секунду:",
        "Смена облика Обакэ:": "Смена облика Обакэ:",
        "Выбрать фотоаппарат": "Выбрать фотоаппарат",
        "Выбрать тип мерцания": "Выбрать тип мерцания",
        "Выбрать модель призрака": "Выбрать модель призрака",
        "Тип мерцаний:": "Тип мерцаний:",
        "Применить": "Применить",
        "Вставьте ссылку": "Вставьте ссылку",
        "Обычный": "Обычный",
        "Фантом": "Фантом",
        "Они": "Они",
        "Деоген": "Деоген",
        "1 сбитый": "1 сбитый",
        "2 сбитый": "2 сбитый",
        "Включить воспроизведение звука фотографии": "Включить воспроизведение звука фотографии",
        "Включить задержку выбранного фотоаппарата": "Включить задержку выбранного фотоаппарата",
        "Длиннейшее пропадание": "Длиннейшее пропадание",
        "soshyrey": "soshyrey",
        "dont lucky": "dont lucky",
        "Длиннейшее появление": "Длиннейшее появление",
        "22 секунда охоты": "22 секунда охоты",
        "1ый обакэ (12 мерцание)": "1ый обакэ (12 мерцание)",
        "Они временно не доступен из-за технических ограничений": "Они временно не доступен из-за технических ограничений",
        "Видно": "Видно",
        "Не видно": "Не видно",
        "мс": "мс",
        "Отображение периода мерцаний призрака": "Отображение периода мерцаний призрака",
        "Индикатор текущего мерцания призрака": "Индикатор текущего мерцания призрака",
        "Правильное отображения мерцаний в начале охоты": "Правильное отображения мерцаний в начале охоты",
        "Включить появление Обакэ": "Включить появление Обакэ",
        "Сменить язык": "Сменить язык",
        "Задержка при зажатии (до 400 мс)": "Задержка при зажатии (до 400 мс)",
    },
    "ua": {
        "Фото:": "Фото:",
        "Комбо:": "Комбо:",
        "Фото: 0": "Фото: 0",
        "Комбо: 0": "Комбо: 0",
        "Старт": "Старт",
        "Сделано": "Зроблено",
        "FAQ (Часто задаваемые вопросы)": "FAQ (Часто задавані питання)",
        "- Что это такое?": "- Що це таке?",
        "Утилита, имитирующая мерцания призраков в игре Фазмафобия и дающая возможность научиться фотографировать призрака.": "Утиліта, що імітує блимання привидів у грі Фазмафобія і дає змогу навчитися фотографувати привида.",
        "- Как использовать?": "- Як використовувати?",
        "В настройках выбрать модель и тип мерцаний, после чего нажать кнопку старт.": "У налаштуваннях вибрати модель і тип блиманнь, після чого натиснути кнопку старт.",
        "- Почему не регает клики?": "- Чому не регає кліки?",
        "Засчитывает только когда видно призрака. Убедитесь, что вы не нажимаете на клавишу рестарт.": "Зараховує тільки коли видно привида. Переконайтеся, що ви не натискаєте на клавішу рестарт.",
        "- Можно ли добавить своё изображение?": "- Чи можна додати своє зображення?",
        "Да, выбрать custom и вставить ссылку из интернета (можно загрузить, например, в Дискорд и скопировать ссылку).": "Так, вибрати custom і вставити посилання з інтернету (можна завантажити, наприклад, у Дискорд і скопіювати посилання).",
        "Отдельное спасибо:": "Щиро дякуємо:",
        "Сохранять выбранные настройки": "Зберігати вибрані налаштування",
        "Показывать таймлайн:": "Показувати таймлайн:",
        "Показывать стрелочку:": "Показувати стрілочку:",
        "Добавить 1 секунду:": "Додати 1 секунду:",
        "Смена облика Обакэ:": "Зміна форми Обаке:",
        "Выбрать фотоаппарат": "Вибрати фотоапарат",
        "Выбрать тип мерцания": "Вибрати тип блимання",
        "Выбрать модель призрака": "Вибрати форму привида",
        "Тип мерцаний:": "Тип блиманнь:",
        "Применить": "Застосувати",
        "Вставьте ссылку": "Вставте посилання",
        "Обычный": "Звичайний",
        "Фантом": "Фантом",
        "Они": "Оні",
        "Деоген": "Деоген",
        "1 сбитый": "1 зсунутий",
        "2 сбитый": "2 зсунутий",
        "Включить воспроизведение звука фотографии": "Увімкнути відтворення звуку фотографії",
        "Включить задержку выбранного фотоаппарата": "Увімкнути затримку обраного фотоапарата",
        "Длиннейшее пропадание": "Найдовше зникнення",
        "soshyrey": "soshyrey",
        "dont lucky": "dont lucky",
        "Длиннейшее появление": "Найдовша поява",
        "22 секунда охоты": "22 секунда атаки",
        "1ый обакэ (12 мерцание)": "1-ий обаке (12 блимання)",
        "Они временно не доступен из-за технических ограничений": "Оні тимчасово недоступний через технічні обмеження",
        "Видно": "Видно",
        "Не видно": "Не видно",
        "мс": "мс",
        "Отображение периода мерцаний призрака": "Відображення періоду блиманнь привида",
        "Индикатор текущего мерцания призрака": "Індикатор поточного блимання привида",
        "Правильное отображения мерцаний в начале охоты": "Правильне відображення блиманнь на початку атаки",
        "Включить появление Обакэ": "Увімкнути появу Обаке",
        "Сменить язык": "Змінити мову",
        "Задержка при зажатии (до 400 мс)": "Затримка при затисканні (до 400 мс)",
    }
};

let choosedLanguage = {};

function translatePage(lang) {
    localStorage.setItem("selectedLanguage", lang);
    
    const langDict = translations[lang] || {};
    
    function translateElement(element) {
        if (element.nodeType === Node.TEXT_NODE && element.nodeValue.trim() !== "") {
            let text = element.nodeValue.trim();
            if (langDict[text]) {
                element.nodeValue = element.nodeValue.replace(text, langDict[text]);
            }
        }
        
        if (element.nodeType === Node.ELEMENT_NODE) {
            if (element.title && langDict[element.title]) {
                element.title = langDict[element.title];
            }
            if (element.placeholder && langDict[element.placeholder]) {
                element.placeholder = langDict[element.placeholder];
            }
            if (element.value && langDict[element.value] && (element.tagName === "INPUT" || element.tagName === "BUTTON")) {
                element.value = langDict[element.value];
            }
        }
        
        for (const child of element.childNodes) {
            translateElement(child);
        }
    }
    
    translateElement(document.body);
}

const savedLang = localStorage.getItem("selectedLanguage");

if (!savedLang) {
    document.querySelector(".language-selection-container").classList.remove("fullHidden");
    document.body.classList.add("no-scroll");
    
    const overlay = document.createElement("div");
    overlay.className = "language-overlay";
    document.body.appendChild(overlay);
    
    const selectLanguage = document.querySelector(".select-language");
    selectLanguage.style.display = "block";
    
    const languageSelect = document.querySelector(".choose-language");
    languageSelect.addEventListener("change", function() {
        const selectedLang = this.value;
        if (selectedLang === "--language--") return;
        
        localStorage.setItem("selectedLanguage", selectedLang);
        window.location.reload();
    });
} else {
    choosedLanguage = translations[savedLang];
    translatePage(savedLang);
}

document.querySelector(".change-language").addEventListener("click", () => {
    localStorage.removeItem("selectedLanguage");
    window.location.reload();

});

