// Массив данных для расчета продолжительности и описания сегментов

const blinkinsDataAll = {
    "Обычный": [
        [0.220, 1, ""],
        [0.380, 0, ""],
        [0.183, 1, "1ый обакэ (12 мерцание)"],
        [0.277, 0, ""],
        [0.080, 1, ""],
        [0.923, 0, "Длиннейшее пропадание"],
        [0.283, 1, "soshyrey"],
        [0.540, 0, ""],
        [0.200, 1, ""],
        [0.100, 0, ""],
        [0.163, 1, ""],
        [0.317, 0, ""],
        [0.251, 1, "dont lucky, 2ой обакэ (27 мерцание)"],
        [0.449, 0, ""],
        [0.183, 1, ""],
        [0.640, 0, ""],
        [0.220, 1, "3ий обакэ (39 мерцание)"],
        [0.229, 0, ""],
        [0.100, 1, ""],
        [0.263, 0, ""]
    ],
    "Фантом": [
        [0.220, 1, ""],
        [1.649, 0, ""],
        [0.180, 1, ""],
        [1.020, 0, ""],
        [0.083, 1, ""],
        [1.520, 0, ""],
        [0.283, 1, ""],
        [1.517, 0, ""],
        [0.200, 1, "22 секунда охоты"],
        [1.083, 0, ""],
        [0.160, 1, ""],
        [1.540, 0, ""],
        [0.251, 1, ""],
        [1.169, 0, ""],
        [0.180, 1, ""],
        [1.823, 0, ""],
        [0.220, 1, ""],
        [1.271, 0, ""],
        [0.100, 1, ""],
        [1.003, 0, ""],
    ]
}

let blinkinsData = blinkinsDataAll["Обычный"];

// Установка авторов
const madeBy = document.querySelector(".made-by");
madeBy.textContent += Math.round(Math.random()) ? "savva_9 & kv1nk" : "kv1nk & savva_9";

// Функция sleep
const sleep = ms => new Promise(resolve => setTimeout(resolve, ms));

// Отключаем контекстное меню ПКМ
document.addEventListener("contextmenu", function(event) {
    event.preventDefault();
});

const overlay = document.querySelector(".overlay");
